mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
void HttpServer::duplicateList(char* tag_start_buf, const char* tag, const int number){
  tag_start_buf += strnlen(tag, 64) + strlen("{{#}}"); // End of start tag.
  
  // Make a new tag to deliminate copies of the list-item.
  char tag_item[69];
  tag_item[0] = '\0';
  strcat(tag_item, "{{+");
  strcat(tag_item, tag);
  strcat(tag_item, "}}");
  tag_item[69] = '\0';

  // Insert new tag.
  if(tag_start_buf + strlen(tag_item) + strlen(tag_start_buf) +1 > buffer + BUFFER_SIZE){
    Serial.println("ERROR: Over-ran buffer");
    return;
  }
  memmove(tag_start_buf + strlen(tag_item), tag_start_buf, strlen(tag_start_buf) +1);
  memmove(tag_start_buf, tag_item, strlen(tag_item));

  // Find the end of the list-item we want to duplicate.
  char end_tag[69];
  end_tag[0] = '\0';
  strcat(end_tag, "{{/");
  strcat(end_tag, tag);
  strcat(end_tag, "}}");
  end_tag[69] = '\0';
  char* tag_end_buf = findPattern(tag_start_buf, end_tag, strlen(tag_start_buf));

  // Move remainder of buffer rightwards and insert multiple copies of the list-item.
  // TODO;: Make sure we can't go over BUFFER_SIZE.
  int tag_length = tag_end_buf - tag_start_buf;
  int move_distance = tag_length * (number -1);
  
  if(tag_end_buf + move_distance + strlen(tag_end_buf) +1 > buffer + BUFFER_SIZE){
    Serial.println("ERROR: Over-ran buffer");
    return;
  }
  memmove(tag_end_buf + move_distance, tag_end_buf, strlen(tag_end_buf) +1);
  for(int i = 1; i < number; i++){
    memmove(tag_start_buf + (tag_length * i), tag_start_buf, tag_length);
  }
}

void HttpServer::removeList(char* tag_start_buf, const char* tag){
  tag_start_buf += strnlen(tag, 64) + strlen("{{#}}"); // End of start tag.

  char end_tag[69];
  end_tag[0] = '\0';
  strcat(end_tag, "{{/");
  strcat(end_tag, tag);
  strcat(end_tag, "}}");
  end_tag[69] = '\0';

  char* tag_end_buf = findPattern(tag_start_buf, end_tag, strlen(tag_start_buf));
  
  memmove(tag_start_buf, tag_end_buf, strlen(tag_end_buf) +1);
}

void HttpServer::replaceTag(char* tag_position, const char* tag, char* tag_content, tagType type){
  Serial.print("tag: ");
  Serial.print(tag);
  Serial.print("  list_parent: ");
  Serial.println(list_parent);

  // These tags should work anywhere. (Either inside or outside lists.
  if(strcmp(tag, "host.mac") == 0){
    uint8_t mac[6];
    WiFi.macAddress(mac);
    String mac_str = macToStr(mac);
    mac_str.toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.hostname") == 0){
    strncpy(tag_content, config->hostname, HOSTNAME_LEN);
  } else if(strcmp(tag, "host.ip") == 0){
    ip_to_string(WiFi.localIP()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.ip") == 0){
    ip_to_string(config->ip).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.subnet") == 0){
    ip_to_string(config->subnet).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.gateway") == 0){
    ip_to_string(config->gateway).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.brokerip") == 0){
    ip_to_string(config->brokerip).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.brokerport") == 0){
    String(config->brokerport).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.subscribeprefix") == 0){
    String(config->subscribeprefix).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.publishprefix") == 0){
    String(config->publishprefix).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.firmwarehost") == 0){
    String(config->firmwarehost).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.firmwaredirectory") == 0){
    String(config->firmwaredirectory).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.firmwareport") == 0){
    String(config->firmwareport).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "config.enablepassphrase") == 0){
    String(config->enablepassphrase).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.rssi") == 0){
    String(WiFi.RSSI()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.cpu_freqency") == 0){
    String(ESP.getCpuFreqMHz()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.flash_size") == 0){
    String(ESP.getFlashChipSize()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.flash_space") == 0){
    String(ESP.getFreeSketchSpace()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.flash_ratio") == 0){
    if(ESP.getFlashChipSize() > 0){
      String(int(100 * ESP.getFreeSketchSpace() / ESP.getFlashChipSize()))
        .toCharArray(tag_content, 128);
    }
  } else if(strcmp(tag, "host.flash_speed") == 0){
    String(ESP.getFlashChipSpeed()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.free_memory") == 0){
    String(ESP.getFreeHeap()).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.sdk_version") == 0){
    strncpy(tag_content, ESP.getSdkVersion(), 128);
  } else if(strcmp(tag, "host.core_version") == 0){
    ESP.getCoreVersion().toCharArray(tag_content, 128);
  } else if(strcmp(tag, "io.analogue_in") == 0){
    String(analogRead(A0)).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.uptime") == 0){
    String(millis() / 1000).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "host.buffer_size") == 0){
    String(BUFFER_SIZE).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "mdns.packet_count") == 0){
    String(mdns->packet_count).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "mdns.buffer_fail") == 0){
    String(mdns->buffer_size_fail).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "mdns.buffer_sucess") == 0){
    String(mdns->packet_count - mdns->buffer_size_fail).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "mdns.largest_packet_seen") == 0){
    String(mdns->largest_packet_seen).toCharArray(tag_content, 128);
  } else if(strcmp(tag, "mdns.success_rate") == 0){
    if(mdns->packet_count > 0){
      String(100 - (100 * mdns->buffer_size_fail / mdns->packet_count))
        .toCharArray(tag_content, 128);
    }
  } else if(strcmp(tag, "fs.files") == 0){
    unsigned int now = millis() / 10000;  // 10 Second intervals.
    if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
      list_cache_time[list_depth] = now;
      list_size[list_depth] = 0;
      bool result = SPIFFS.begin();
      if(result){
        Dir dir = SPIFFS.openDir("/");
        while(dir.next()){
          list_size[list_depth]++;
        }
      } else {
        Serial.println("ERROR: Unable to initialise SPIFFS fs.");
      }
      SPIFFS.end();
    }
    if(type == tagPlain){
      String(list_size[list_depth]).toCharArray(tag_content, 128);
    } else if(type == tagList){
      duplicateList(tag_position, tag, list_size[list_depth]);
    } else if(type == tagInverted){
      if(list_size[list_depth]){
        removeList(tag_position, tag);
      }
    }
  } else if(strcmp(tag, "fs.space.used") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result){
      if(type == tagPlain){
        String(fs_info.usedBytes).toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else if(strcmp(tag, "fs.space.size") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result){
      if(type == tagPlain){
        String(fs_info.totalBytes).toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else if(strcmp(tag, "fs.space.remaining") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result){
      if(type == tagPlain){
        String(fs_info.totalBytes - fs_info.usedBytes).toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else if(strcmp(tag, "fs.space.ratio.used") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result && fs_info.totalBytes > 0){
      if(type == tagPlain){
        String(100.0 * fs_info.usedBytes / fs_info.totalBytes).toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else if(strcmp(tag, "fs.space.ratio.remaining") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result && fs_info.totalBytes > 0){
      if(type == tagPlain){
        String(100.0 * (fs_info.totalBytes - fs_info.usedBytes) / fs_info.totalBytes)
          .toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else if(strcmp(tag, "fs.max_filename_len") == 0){
    bool result = SPIFFS.begin();
    FSInfo fs_info;
    SPIFFS.info(fs_info);
    if(result){
      if(type == tagPlain){
        String(fs_info.maxPathLength -2).toCharArray(tag_content, 128);
      }
    }
    SPIFFS.end();
  } else 
    // The next section matches list tags that need to be called from the top level.
  if(strcmp(list_parent, "") == 0){
    if(strcmp(tag, "host.ssids") == 0){
      unsigned int now = millis() / 10000;  // 10 Second intervals.
      if(list_size[list_depth] < 0 || now != list_cache_time[list_depth]){
        list_cache_time[list_depth] = now;
        list_size[list_depth] = WiFi.scanNetworks();
      }
      if(type == tagPlain){
        String(list_size[list_depth]).toCharArray(tag_content, 128);
      } else if(type == tagList){
        duplicateList(tag_position, tag, list_size[list_depth]);
      } else if(type == tagInverted){
        if(list_size[list_depth]){
          removeList(tag_position, tag);
        }
      }
    } else if(strcmp(tag, "servers.mqtt") == 0){
      Host* p_host;
      bool active;
      list_size[list_depth] = 0;
      brokers->ResetIterater();
      while(brokers->IterateHosts(&p_host, &active)){
        list_size[list_depth]++;
      }
      if(type == tagPlain){
        String(list_size[list_depth]).toCharArray(tag_content, 128);
      } else if(type == tagList){
        duplicateList(tag_position, tag, list_size[list_depth]);
      } else if(type == tagInverted){
        if(list_size[list_depth]){
          removeList(tag_position, tag);
        }
      }
    } else if(strcmp(tag, "config.enableiopin") == 0){
      list_size[list_depth] = 11;  // 11 IO pins available on the esp8266.
      if(type == tagPlain){
        String(list_size[list_depth]).toCharArray(tag_content, 128);
      } else if(type == tagList){
        duplicateList(tag_position, tag, list_size[list_depth]);
      } else if(type == tagInverted){
        if(list_size[list_depth]){
          removeList(tag_position, tag);
        }
      }
    } else if(strcmp(tag, "io.entry") == 0){
      list_size[list_depth] = 0;
      for (int i = 0; i < MAX_DEVICES; ++i) {
        if (strlen(config->devices[i].address_segment[0].segment) > 0) {
          list_size[list_depth]++;
        }
      }
      if(list_size[list_depth] < MAX_DEVICES){
        list_size[list_depth]++;
      }
      if(type == tagPlain){
        String(list_size[list_depth]).toCharArray(tag_content, 128);
      } else if(type == tagList){
        duplicateList(tag_position, tag, list_size[list_depth]);
      } else if(type == tagInverted){
        if(list_size[list_depth]){
          removeList(tag_position, tag);
        }
      }
    }
  } else 
  // The following tags work inside lists.
  if(strcmp(list_parent, "|config.enableiopin") == 0){
    int values[] = {0,1,2,3,4,5,12,13,14,15,16};  // Valid output pins.
    if(strcmp(tag, "config.enableiopin") == 0 and type == tagListItem){
      list_element[list_depth]++;
    } else if(strcmp(tag, "value") == 0){
      String(values[list_element[list_depth]]).toCharArray(tag_content, 128);
    } else if(strcmp(tag, "selected") == 0){
      if(type == tagPlain){
        if(config->enableiopin == values[list_element[list_depth]]){
          strcpy(tag_content, "selected");
        }
      } else if(type == tagList){
        if(config->enableiopin != values[list_element[list_depth]]){
          removeList(tag_position, tag);
        }
      } else if(type == tagInverted){
        if(config->enableiopin == values[list_element[list_depth]]){
          removeList(tag_position, tag);
        }
      }
    }
  } else if(strcmp(list_parent, "|io.entry") == 0){
    // Not every config->devices entry is populated.
    int index = config->labelToIndex(list_element[list_depth]);

    if(strcmp(tag, "io.entry") == 0 and type == tagListItem){
      list_element[list_depth]++;

