mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
    } else if(strcmp(tag, "index") == 0){
      String(index).toCharArray(tag_content, 128);
    } else if(strcmp(tag, "topic") == 0){
      if(type == tagPlain){
        DeviceAddress(config->devices[index]).toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "default") == 0){
      if(type == tagPlain){
        String(config->devices[index].io_default)
          .toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "inverted") == 0){
      if(type == tagPlain){
        String(config->devices[index].inverted ? "Y":"N")
          .toCharArray(tag_content, 128);
      } else if(type == tagList){
        if(!config->devices[index].inverted){
          removeList(tag_position, tag);
        }
      } else if(type == tagInverted){
        if(config->devices[index].inverted){
          removeList(tag_position, tag);
        }
      }
    } else if(strcmp(tag, "pin") == 0){
      list_size[list_depth] = 11;  // 11 IO pins available on the esp8266.
      if(type == tagPlain){
        String(list_size[list_depth]).toCharArray(tag_content, 128);
      } else if(type == tagList){
        duplicateList(tag_position, tag, list_size[list_depth]);
      } else if(type == tagInverted){
        if(list_size[list_depth]){
          removeList(tag_position, tag);
        }
      }
    }
  } else if(strcmp(list_parent, "|io.entry|pin") == 0){
    int io_entry_index = config->labelToIndex(list_element[list_depth -1]);  // Value of the parent.
    int values[] = {0,1,2,3,4,5,12,13,14,15,16};  // Valid output pins.
    if(strcmp(tag, "pin") == 0 and type == tagListItem){
      list_element[list_depth]++;
    } else if(strcmp(tag, "value") == 0){
      Serial.println(values[list_element[list_depth]]);
      String(values[list_element[list_depth]]).toCharArray(tag_content, 128);
    } else if(strcmp(tag, "selected") == 0){
      if(type == tagPlain){
        if(config->devices[io_entry_index].io_pin == values[list_element[list_depth]]){
          strcpy(tag_content, "selected");
        }
      } else if(type == tagList){
        if(config->devices[io_entry_index].io_pin != values[list_element[list_depth]]){
          removeList(tag_position, tag);
        }
      } else if(type == tagInverted){
        if(config->devices[io_entry_index].io_pin == values[list_element[list_depth]]){
          removeList(tag_position, tag);
        }
      }
    }
  } else if(strcmp(list_parent, "|host.ssids") == 0){
    if(strcmp(tag, "host.ssids") == 0 and type == tagListItem){
      list_element[list_depth]++;
    } else if(strcmp(tag, "name") == 0){
      WiFi.SSID(list_element[list_depth]).toCharArray(tag_content, 128);
    } else if(strcmp(tag, "signal") == 0){
      String(WiFi.RSSI(list_element[list_depth])).toCharArray(tag_content, 128);
    }
  } else if(strcmp(list_parent, "|servers.mqtt") == 0){
    Host* p_host;
    bool active;
    brokers->GetLastHost(&p_host, active);
    if(strcmp(tag, "servers.mqtt") == 0 and type == tagListItem){
      brokers->IterateHosts(&p_host, &active);
      list_element[list_depth]++;
    } else if(strcmp(tag, "service_name") == 0){
      if(type == tagPlain){
        p_host->service_name.toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "host_name") == 0){
      if(type == tagPlain){
        p_host->host_name.toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "address") == 0){
      if(type == tagPlain){
        ip_to_string(p_host->address).toCharArray(tag_content, 128);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "port") == 0){
      if(type == tagPlain){
        String(p_host->port).toCharArray(tag_content, 128);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "service_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->service_valid_until).toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "host_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->host_valid_until).toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "ipv4_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->ipv4_valid_until).toCharArray(tag_content, 128);
      }
    } else if(strcmp(tag, "sucess_counter") == 0){
      if(type == tagPlain){
        String(p_host->sucess_counter).toCharArray(tag_content, 128);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "fail_counter") == 0){
      if(type == tagPlain){
        String(p_host->fail_counter).toCharArray(tag_content, 128);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "connection_attempts") == 0){
      if(type == tagPlain){
        String(p_host->sucess_counter + p_host->fail_counter).toCharArray(tag_content, 128);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "active") == 0){
      if(type == tagPlain){
        if(active){
          strncpy(tag_content, "active", 128);
        }
      } else if(type == tagList){
        if(!active){
          removeList(tag_position, tag);
        }
      } else if(type == tagInverted){
        if(active){
          removeList(tag_position, tag);
        }
      }
    }
  } else if(strcmp(list_parent, "|fs.files") == 0){
    bool result = SPIFFS.begin();
    if(result){
      Dir dir = SPIFFS.openDir("/");
      for(int i=0; i <= list_element[1] && dir.next(); i++){ }

      if(strcmp(tag, "fs.files") == 0 and type == tagListItem){
        list_element[list_depth]++;
      } else if(strcmp(tag, "filename") == 0){
        if(type == tagPlain){
          File file = dir.openFile("r");
          String filename = file.name();
          filename.remove(0, 1);
          filename.toCharArray(tag_content, 128);
          file.close();
        }
      } else if(strcmp(tag, "size") == 0){
        if(type == tagPlain){
          File file = dir.openFile("r");
          String(file.size()).toCharArray(tag_content, 128);
          file.close();
        }
      } else if(strcmp(tag, "is_mustache") == 0){
        File file = dir.openFile("r");
        String filename = file.name();
        file.close();
        bool test = filename.endsWith(".mustache");
        if(type == tagPlain){
          strncpy(tag_content, (test ? "Y":"N"), 128);
        } else if(type == tagList){
          if(!test){
            removeList(tag_position, tag);
          }
        } else if(type == tagInverted){
          if(test){
            removeList(tag_position, tag);
          }
        }
      }
    }
    SPIFFS.end();
  }

  int tag_len_diff = strlen(tag_content) - strlen(tag) - strlen("{{}}");
  char* buffer_remainder = tag_position + strlen(tag) + strlen("{{}}");
  if(type != tagPlain){
    // The other tag types are 1 char longer than tagPlain.
    tag_len_diff--;
    buffer_remainder++;
  }
  // TODO: Make sure we can't go over BUFFER_SIZE.
  memmove(buffer_remainder + tag_len_diff, buffer_remainder, strlen(buffer_remainder) +1);
  memmove(tag_position, tag_content, strlen(tag_content));
}

char* HttpServer::findPattern(char* buff, const char* pattern, int line_len) const{
  for(int i = 0; i < line_len; i++){
    if(strncmp (buff + i, pattern, strlen(pattern)) == 0){
      return buff +i;
    }
  }
  return NULL;
}
